int incomingByte;
#include "IRremote.h"
#include <Servo.h> 
#define pi  3.14 //Αρχικοποίηση του π

//----------------------------Δήλωση Servo-------------------------------

Servo axonas1; //Ο servo στην βάση του mr.robot
Servo axonas2; //O servo ανάμεσα στο μπράτσο l1 και l2
Servo akro;    //O servo στο άκρο εργασίας

//-----------------------------Δήλωση γωνιών-----------------------------

float angle1;  //Γωνία του πρώτου άξονα
float angle2;  //Γωνία του δεύτερου άξονα

//------------------------Δήλωση μήκους μπράτσων-------------------------

const int l1 = 11;  // Μήκος του l1 
const float l2 = 11.5;  // Μήκος του l2

//-----------------------------------------------------------------------


//-------------------Δήλωση αντικειμένων Υπέρυθρων-----------------------
      
//-----------------------------------------------------------------------

//Μεγέθη για τον υπολογισμό των γωνιών
double A; 
double B;  
double C;  
double th;        

//Σημεία ενδιαφέροντος
double x;  // Eπιθυμητό σημείο x
double y;  // Eπιθυμητό σημείο y
double c;  // Υποτείνουσα που σχηματίζετε απο τα σημεία x,y 

//-----------------------------------------------------------------------

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~VOID SETUP~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void setup()
{
  pinMode(7, OUTPUT);
  pinMode(8, OUTPUT);
  pinMode(9, OUTPUT);
  pinMode(10, OUTPUT);
  pinMode(11, OUTPUT);
  pinMode(12, OUTPUT);
  pinMode(13, OUTPUT);
  
  Serial.begin(9600);
  axonas1.attach(2); //Τοποθέτηση servo1 στο pin2 (Βάση)           
  axonas2.attach(3); //Τοποθέτηση servo2 στο pin3 (Ενδιάμεσα από τα μπράτσα)
  akro.attach(4);    //Τοποθέτηση servo3 στο pin4 (Άκρο)
  akro.write(95);     //Τοποθέτηση γραφίδας προς τα πάνω
  x=0;               //Αρχικό σημείο Χ
  y=8;               //Αρχικό σημείο Y
  anglecalculation();//Κάνουμε μια φορά τον υπολογισμό με βάση τις συντεταγμένες  
  robotmove();       //και εκτελούμε την κίνηση
  akro.write(180);
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~VOID LOOP~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void loop()
{ 
         if (Serial.available() > 0) {
                // read the incoming byte:
                incomingByte = Serial.read()-48;
                translateIR();
        }    
}

//Υπολογισμός γωνιών με βάση τα δοσμένα σημεία
void anglecalculation()
{ 

  c = sqrt( pow(x,2) + pow(y,2) );                          
  B = (acos( (pow(l2,2) - pow(l1,2) - pow(c,2))/(-2*l1*c) )) * (180/pi);            
  C = (acos( (pow(c,2) - pow(l1,2) - pow(l1,2))/(-2*l1*l2) )) * (180/pi); 
  th = (asin( y / c )) * (180/pi);                    
  angle1 = B + th  ;                  
  angle2 = C ;                           
}

//Γενική Κίνηση Servo
void robotmove() 
{
  axonas1.write(angle1);
  axonas2.write(angle2); 
  delay(10); 
}


//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Κινήσεις 7-ΤΑΕ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

void kinishYp(void){
  for(int i=1;i<=15;i++){ //Για 15 φορές υπολόγιζε τις γωνίες με βάση τις προυπάρχουσες συντεταγμένες
    anglecalculation();          
    robotmove();          //και κάνε κίνηση των servo 
    delay(50);
    y=y+0.1;              //Αύξησε την μετατόπηση του y κατα 0.1 cm
  }
}

void kinishYp4(void){
  for(int i=1;i<=20;i++){ //Για 15 φορές υπολόγιζε τις γωνίες με βάση τις προυπάρχουσες συντεταγμένες
    anglecalculation();          
    robotmove();          //και κάνε κίνηση των servo 
    delay(50);
    y=y+0.1;              //Αύξησε την μετατόπηση του y κατα 0.1 cm
  }
}

void kinishXd(void){
  for(int i=1;i<=20;i++){ //Για 20 φορές υπολόγιζε τις γωνίες με βάση τις προυπάρχουσες συντεταγμένες
    anglecalculation();           
    robotmove();          //και κάνε κίνηση των servo               
    delay(50);
    x=x+0.1;              //Αύξησε την μετατόπηση του x κατα 0.1 cm
  }
}
void kinishXd2(void){
  for(int i=1;i<=20;i++){ //Για 20 φορές υπολόγιζε τις γωνίες με βάση τις προυπάρχουσες συντεταγμένες
    anglecalculation();           
    robotmove();          //και κάνε κίνηση των servo               
    delay(50);
    x=x+0.1;    //Αύξησε την μετατόπηση του x κατα 0.1 cm
    y=y+0.01;
  }
}
void kinishXd3(void){
  for(int i=1;i<=17;i++){ //Για 20 φορές υπολόγιζε τις γωνίες με βάση τις προυπάρχουσες συντεταγμένες
    anglecalculation();           
    robotmove();          //και κάνε κίνηση των servo               
    delay(50);
    x=x+0.1;              //Αύξησε την μετατόπηση του x κατα 0.1 cm
  }
}

void kinishXd4(void){
  for(int i=1;i<=10;i++){ //Για 20 φορές υπολόγιζε τις γωνίες με βάση τις προυπάρχουσες συντεταγμένες
    anglecalculation();           
    robotmove();          //και κάνε κίνηση των servo               
    delay(50);
    x=x+0.1;              //Αύξησε την μετατόπηση του x κατα 0.1 cm
  }
}

void kinishXd6(void){
  for(int i=1;i<=25;i++){ //Για 20 φορές υπολόγιζε τις γωνίες με βάση τις προυπάρχουσες συντεταγμένες
    anglecalculation();           
    robotmove();          //και κάνε κίνηση των servo               
    delay(50);
    x=x+0.1;              //Αύξησε την μετατόπηση του x κατα 0.1 cm
  }
}
void kinishYk(void){
  for(int i=1;i<=15;i++){ //Για 15 φορές υπολόγιζε τις γωνίες με βάση τις προυπάρχουσες συντεταγμένες
    anglecalculation();           
    robotmove();          //και κάνε κίνηση των servo              
    delay(50);
    y=y-0.1;              //Μείωσε την μετατόπηση του y κατα 0.1 cm
  }
}
void kinishYk4(void){
  for(int i=1;i<=20;i++){ //Για 15 φορές υπολόγιζε τις γωνίες με βάση τις προυπάρχουσες συντεταγμένες
    anglecalculation();           
    robotmove();          //και κάνε κίνηση των servo              
    delay(50);
    y=y-0.1;              //Μείωσε την μετατόπηση του y κατα 0.1 cm
  }
}

void kinishXa(void){
  for(int i=1;i<=20;i++){ //Για 20 φορές υπολόγιζε τις γωνίες με βάση τις προυπάρχουσες συντεταγμένες
    anglecalculation();           
    robotmove();          //και κάνε κίνηση των servo               
    delay(50);
    x=x-0.1;              //Μείωσε την μετατόπηση του χ κατα 0.1 cm
  }
}

void kinishXa3(void){
  for(int i=1;i<=25;i++){ //Για 20 φορές υπολόγιζε τις γωνίες με βάση τις προυπάρχουσες συντεταγμένες
    anglecalculation();           
    robotmove();          //και κάνε κίνηση των servo               
    delay(50);
    x=x-0.1;              //Μείωσε την μετατόπηση του χ κατα 0.1 cm
  }
}
void kinishXa4(void){
  for(int i=1;i<=13;i++){ //Για 20 φορές υπολόγιζε τις γωνίες με βάση τις προυπάρχουσες συντεταγμένες
    anglecalculation();           
    robotmove();          //και κάνε κίνηση των servo               
    delay(50);
    x=x-0.1;              //Μείωσε την μετατόπηση του χ κατα 0.1 cm
  }
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~Συνάρτηση ομαλής περιστροφής άκρου (stylus) προς την θέση γραφής~~~~~~~~~~~~
void akroPros180 (){ // 172 moires einai katakorufa to stulo
  for(int pos = 95; pos <= 172; pos += 1){                                 
    akro.write(pos);              
    delay(20);                      
  } 
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~Συνάρτηση ομαλής περιστροφής άκρου προς την θέση ισορροπίας~~~~~~~~~
void akroPros0 (){
  for(int pos = 172; pos>=95; pos-=1){                                 
    akro.write(pos);              
    delay(20);                      
  } 
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

